# Exploring the MovieLens 1M Dataset

#### Extrated (and slightly modified) from *Python for Data Analysis (Wes McKinney)*

This dataset contains 1 million ratings collected from 6000 users on 4000 movies, and it is organized into three tables:


*   Ratings
*   Users
*   Movie information

Each table is available as a separate file, each containing a series of rows where columns are separated by *::*


[Download the dataset here](http://files.grouplens.org/datasets/movielens/ml-1m.zip)

This example illustrates a series of interesting things that we can learn from this dataset. Most operations will be performed using the pandas library. For more details, please refer to *Python for Data Analysis - page 26*.

## **Code**

Let's begin by importing pandas. It is conventional to use *pd* to denote pandas

In [1]:
import pandas as pd

Next we will import each of the three tables and assign names to each of the columns:

In [2]:
unames = ['user_id', 'gender', 'age', 'occupation', 'zip']
users = pd.read_table('ml-1m/users.dat', sep='::', header=None, names=unames, engine='python',encoding='utf-8')

In [3]:
rnames = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings = pd.read_table('ml-1m/ratings.dat', sep='::', header=None, names=rnames, engine='python',encoding='utf-8')

In [4]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('ml-1m/movies.dat', sep='::', header=None, names=mnames, engine='python',encoding='latin-1')

Let's take a look at the first 5 rows of each table:

In [5]:
users[:5]

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [6]:
ratings[:5]

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [7]:
movies[:5]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

Having all information spread across different tables makes it much more dificult to analyse the data. Using pandas's merge function, we first merge ratings with users then we merge that result with the movies data. pandas infers which columns to
use as the merge (or join) keys based on overlapping names:

In [8]:
data = pd.merge(pd.merge(ratings, users), movies)

In [9]:
data

,user_id,movie_id,rating,timestamp,gender,age,occupation,zip,title,genres
0,1,1193,5,978300760,F,1,10,48067,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,1193,5,978298413,M,56,16,70072,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,1193,4,978220179,M,25,12,32793,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,1193,4,978199279,M,25,7,22903,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,1193,5,978158471,M,50,1,95350,One Flew Over the Cuckoo's Nest (1975),Drama
...,...,...,...,...,...,...,...,...,...,...
1000204,5949,2198,5,958846401,M,18,17,47901,Modulations (1998),Documentary
1000205,5675,2703,3,976029116,M,35,14,30030,Broken Vessels (1998),Drama
1000206,5780,2845,1,958153068,M,18,17,92886,White Boys (1999),Drama
1000207,5851,3607,5,957756608,F,18,20,55410,One Little Indian (1973),Comedy|Drama|Western
1000208,5938,2909,4,957273353,M,25,1,35401,"Five Wives, Three Secretaries and Me (1998)",Documentary

Below is the first row in that dataset

In [10]:
data.head(1)

,user_id,movie_id,rating,timestamp,gender,age,occupation,zip,title,genres
0,1,1193,5,978300760,F,1,10,48067,One Flew Over the Cuckoo's Nest (1975),Drama

# Q1

In [11]:
x = data[data['age']>25]
x

,user_id,movie_id,rating,timestamp,gender,age,occupation,zip,title,genres
1,2,1193,5,978298413,M,56,16,70072,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,1193,5,978158471,M,50,1,95350,One Flew Over the Cuckoo's Nest (1975),Drama
9,33,1193,5,978557765,M,45,3,55421,One Flew Over the Cuckoo's Nest (1975),Drama
12,44,1193,4,978018995,M,45,17,98052,One Flew Over the Cuckoo's Nest (1975),Drama
17,54,1193,5,977944039,M,50,1,56723,One Flew Over the Cuckoo's Nest (1975),Drama
...,...,...,...,...,...,...,...,...,...,...
1000199,5334,3382,5,960796159,F,56,13,46140,Song of Freedom (1936),Drama
1000201,5433,286,3,960240881,F,35,17,45014,Nemesis 2: Nebula (1995),Action|Sci-Fi|Thriller
1000202,5494,3530,4,959816296,F,35,17,94306,Smoking/No Smoking (1993),Comedy
1000203,5556,2198,3,959445515,M,45,6,92103,Modulations (1998),Documentary
1000205,5675,2703,3,976029116,M,35,14,30030,Broken Vessels (1998),Drama

In [12]:
x.groupby('genres')['rating'].mean()

genres
Action                                           3.479086
Action|Adventure                                 3.661378
Action|Adventure|Animation                       4.029851
Action|Adventure|Animation|Children's|Fantasy    2.930233
Action|Adventure|Animation|Horror|Sci-Fi         3.492462
                                                   ...
Sci-Fi|Thriller|War                              3.489011
Sci-Fi|War                                       4.470410
Thriller                                         3.651084
War                                              3.919656
Western                                          3.818442
Name: rating, Length: 301, dtype: float64

In [13]:
from tqdm.notebook import tqdm
tqdm.pandas()

In [33]:
y = x[['user_id','genres','rating']].drop_duplicates()

In [34]:
y.shape

(208478, 3)

In [16]:
df = pd.DataFrame([],columns=['genres','rating'])
for indx,line in tqdm(y.iterrows()):
    genres = line['genres'].split('|')
    if len(genres)>1:
        for i in genres:
             df.loc[len(df)] = [i,line['rating']]

0it [00:00, ?it/s]

KeyboardInterrupt:

In [35]:
y = y[['genres','rating']]

In [26]:
y = y.drop(to_del)

In [42]:
y = y[y['genres'].apply(lambda x: len(x.split('|'))==1)]

In [45]:
y = pd.concat([y,df])

In [46]:
y

        genres  rating
1        Drama       5
4        Drama       5
9        Drama       5
12       Drama       4
17       Drama       5
...        ...     ...
134325   Drama       3
134326  Action       4
134327   Drama       4
134328  Action       4
134329   Drama       4

[165587 rows x 2 columns]

In [48]:
y.groupby('genres')['rating'].mean()

genres
Action         3.791426
Adventure      3.888107
Animation      3.909832
Children's     3.958867
Comedy         3.725378
Crime          3.961598
Documentary    3.816342
Drama          3.902596
Fantasy        3.989310
Film-Noir      4.176634
Horror         3.143000
Musical        3.927618
Mystery        3.492901
Romance        3.837047
Sci-Fi         3.831491
Thriller       3.795837
War            4.074295
Western        3.806759
Name: rating, dtype: float64

# Q2

In [ ]:
data_q2 = data[['user_id','movie_id','title','rating']].drop_duplicates()
data_q2

In [ ]:
data_q2.groupby('title')['rating'].count().sort_values(ascending=False)[:5]

# Q3

In [ ]:
data_q3 = data[['user_id','movie_id','age','rating']].drop_duplicates()
data_q3

In [ ]:
def f(x):
    if x<=18:
        return '<=18'
    elif x>=19 and x<=30:
        return '19-30'
    elif x>=31 and x<=50:
        return '31-50'
    elif x>=51 and x<=70:
        return '51-70'
    else:
        return '>=71'

In [ ]:
data_q3['age'] = data_q3['age'].apply(lambda x:f(x))

In [ ]:
data_q3.groupby('age')['rating'].mean()

# Q4

In [ ]:
from datetime import datetime

In [ ]:
f = lambda timestamp: datetime.fromtimestamp(timestamp)

In [ ]:
data['timestamp'] = data['timestamp'].apply(f)

In [ ]:
data['year'] = data['timestamp'].dt.year

In [ ]:
data_q4 = data[data['year']==2003]

In [ ]:
def f(x):
    if x<=18:
        return 'under 18'
    elif x>=19 and x<=45:
        return '19 to 45'
    else:
        return 'Above 45'

In [ ]:
data_q4['age'] = data_q4['age'].apply(lambda x:f(x))

In [ ]:
data_q4 = data_q4[['title','age','rating']]

In [ ]:
x = data_q4.groupby('title')['age'].apply(list)

In [ ]:
x = pd.DataFrame(x)

In [ ]:
x.reset_index(inplace=True)

In [ ]:
x = x[x['age'].apply(lambda x: len(set(x))==3)]

In [ ]:
x

# Q5

In [ ]:
def movie_rating(user_id,movie_id):
    data_q5 = data[data['user_id']==user_id]
    rating = data[(data['user_id']==user_id) & (data['movie_id']==movie_id)]['rating'][0]
    return list(set(data_q5[data_q5['rating']==rating]['title'].tolist()))

In [ ]:
movie_rating(1,1193)

# Q6

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
sns.countplot(data=data,x='rating')
plt.show()

In [ ]:
data.describe()

In [ ]:
data.info()

In [ ]:
x = data.groupby('age')['rating'].mean()
x

In [ ]:
plt.bar(x.index,list(x),width = 0.4,color='g')
plt.xlabel('Age')
plt.ylabel('mean rating')
plt.show()

In [ ]:
sns.countplot(data=data,x='gender')
plt.show()

In [ ]:
x = data.groupby('gender')['rating'].mean()
x

In [ ]:
plt.bar(x.index,list(x),width = 0.4,color='g')
plt.xlabel('gender')
plt.ylabel('mean rating')
plt.show()